---
kind: property
id: P:Autodesk.Revit.DB.Material.Transparency
zh: 材质、材料
source: html/71499d4f-686b-c708-fd87-a3f6523b3189.htm
---
# Autodesk.Revit.DB.Material.Transparency Property

**中文**: 材质、材料

The transparency of the material.

## Syntax (C#)
```csharp
public int Transparency { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: values for shininess must be between 0 and 128